
########################### Define Top Module ############################
                                                   
set top_module SYS_TOP

######################### Formality Setup File ###########################

set synopsys_auto_setup true

set_svf "../../Synthesis/$top_module.svf"


set SSLIB "/home/IC/tsmc_fb_cl013g_sc/aci/sc-m/synopsys/scmetro_tsmc_cl013g_rvt_ss_1p08v_125c.db"
set TTLIB "/home/IC/tsmc_fb_cl013g_sc/aci/sc-m/synopsys/scmetro_tsmc_cl013g_rvt_tt_1p2v_25c.db"
set FFLIB "/home/IC/tsmc_fb_cl013g_sc/aci/sc-m/synopsys/scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c.db"

######################### Reference Container ############################

## Read Reference technology libraries
read_db -container Ref [list $SSLIB $TTLIB $FFLIB]

## Read Reference Design Files
read_verilog -container Ref "/home/IC/Final_System/RTL/ALU/ALU.v"
read_verilog -container Ref "/home/IC/Final_System/RTL/UART/UART_RX/Edge_Bit_Counter.v"
read_verilog -container Ref "/home/IC/Final_System/RTL/UART/UART_RX/Deserializer.v"
read_verilog -container Ref "/home/IC/Final_System/RTL/UART/UART_RX/Data_Sampling.v"
read_verilog -container Ref "/home/IC/Final_System/RTL/UART/UART_TX/UART_TOP.v"
read_verilog -container Ref "/home/IC/Final_System/RTL/UART/UART_TX/Serializer_1byte.v"
read_verilog -container Ref "/home/IC/Final_System/RTL/UART/UART_TX/Parity_Calc.v"
read_verilog -container Ref "/home/IC/Final_System/RTL/UART/UART_TX/MUX_4x1.v"
read_verilog -container Ref "/home/IC/Final_System/RTL/UART/UART_TX/FSM.v"
read_verilog -container Ref "/home/IC/Final_System/RTL/SYS_Cont/SYS_CTRL.v"
read_verilog -container Ref "/home/IC/Final_System/RTL/RST_SYNC/RST_SYN.v"
read_verilog -container Ref "/home/IC/Final_System/RTL/RegFile/Reg_File.v"
read_verilog -container Ref "/home/IC/Final_System/RTL/PULSE_GEN/PULSE_GEN.v"
read_verilog -container Ref "/home/IC/Final_System/RTL/DATA_SYNC/DATA_SYNC.v"
read_verilog -container Ref "/home/IC/Final_System/RTL/CLK_Gating/CLK_GATE.v"
read_verilog -container Ref "/home/IC/Final_System/RTL/CLK_DIV_MUX/RX_CLKDIV_MUX.v"
read_verilog -container Ref "/home/IC/Final_System/RTL/CLK_DIV/Integer_ClkDiv.v"
read_verilog -container Ref "/home/IC/Final_System/RTL/ASY_FIFO/FIFO_W.v"
read_verilog -container Ref "/home/IC/Final_System/RTL/ASY_FIFO/FIFO_R.v"
read_verilog -container Ref "/home/IC/Final_System/RTL/ASY_FIFO/FIFO_MEM.v"
read_verilog -container Ref "/home/IC/Final_System/RTL/ASY_FIFO/BIT_SYNC.v"
read_verilog -container Ref "/home/IC/Final_System/RTL/ASY_FIFO/AS_FIFO_TOP.v"
read_verilog -container Ref "/home/IC/Final_System/RTL/SYS_TOP/SYS_TOP.v"
read_verilog -container Ref "/home/IC/Final_System/RTL/UART/UART_RX/UART_RX_TOP.v"
read_verilog -container Ref "/home/IC/Final_System/RTL/UART/UART_RX/Stop_Check.v"
read_verilog -container Ref "/home/IC/Final_System/RTL/UART/UART_RX/Start_Check.v"
read_verilog -container Ref "/home/IC/Final_System/RTL/UART/UART_RX/RX_FSM.v"
read_verilog -container Ref "/home/IC/Final_System/RTL/UART/UART_RX/Parity_Check.v"


## set the top Reference Design 
set_reference_design $top_module
set_top $top_module


######################## Implementation Container #########################

## Read Implementation technology libraries
read_db -container Imp [list $SSLIB $TTLIB $FFLIB]

## Read Implementation Design Files
read_verilog -container Imp -netlist "/home/IC/Final_System/Synthesis/netlists/SYS_TOP.v"

## set the top Implementation Design
set_implementation_design $top_module
set_top $top_module


## matching Compare points
match

## verify
set successful [verify]
if {!$successful} {
diagnose
analyze_points -failing
}

report_passing_points    > "reports/passing_points.rpt"
report_failing_points    > "reports/failing_points.rpt"
report_aborted_points    > "reports/aborted_points.rpt"
report_unverified_points > "reports/unverified_points.rpt"


start_gui
