setAnalysisMode -checkType setup -clkSrcPath false -clockPropagation forcedIdeal -cts preCTS -skew true -virtualIPO false
setTrialRouteMode -handlePreroute true -keepMarkedOptRoutes true
setOptMode -congOpt false -drcMargin 0 -effort high -fixDrc true -route noPreserve -rPlace true -setupTargetSlack 0
setExtractRCMode  -engine default
setDelayCalMode -engine default
setNanoRouteMode -quiet -drouteAntennaFactor 1.000000
setNanoRouteMode -quiet -droutePostRouteMinimizeViaCount false
setNanoRouteMode -quiet -droutePostRouteSpreadWire false
setNanoRouteMode -quiet -droutePostRouteSwapVia "none"
setNanoRouteMode -quiet -droutePostRouteWidenWire "none"
setNanoRouteMode -quiet -drouteStartIteration 0
setNanoRouteMode -quiet -envNumberWarningLimit 20
setNanoRouteMode -quiet -routeSiEffort "low"
setNanoRouteMode -quiet -routeTdrEffort 1
setNanoRouteMode -quiet -routeTopRoutingLayer 6

setPlaceMode -ignoreScan true -timingDriven true -useNP true -WLHighEffort false
